# Apply Functions to DataFrame

In [46]:
import pandas as pd
import numpy as np
# Create Data
stuff = {
    'Corporation':['Apple', 'Google', 'Meta', 'Apple', 'Google','Meta'],
    'Employees':['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary':[200, 220, 190, 130, 120, 150]}
# Create Dataframe
df = pd.DataFrame(stuff)
df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

## Create Function

In [47]:
# Create Function
def times1000(x):
    return format(x * 1000, ',d')

## Use Apply function

In [48]:
# Use Apply function
df.Salary.apply(times1000)

0    200,000
1    220,000
2    190,000
3    130,000
4    120,000
5    150,000
Name: Salary, dtype: object

## Make it into a DataFrame

In [49]:
# Make it into a DataFrame
pd.DataFrame(df.Salary.apply(times1000))

    Salary
0  200,000
1  220,000
2  190,000
3  130,000
4  120,000
5  150,000

## Add Elder last name function

In [50]:
# Add Elder last name function
"""def namer(x):
    if x == "John":
        return "John Elder"
    else:
        return x
"""
def namer(x):
    return "John Elder" if x == "John" else x

## Show Elder last name

In [51]:
# Show Elder last name
df.Employees.apply(namer)

0    John Elder
1         April
2           Wes
3          Beth
4        Justin
5         Steph
Name: Employees, dtype: object

## Use a lambda function

In [52]:
# Use a lambda
df.Salary.apply(lambda x: x * 1000)

0    200000
1    220000
2    190000
3    130000
4    120000
5    150000
Name: Salary, dtype: int64

In [53]:
pd.DataFrame(df.Salary.apply(lambda x: x * 1000))

   Salary
0  200000
1  220000
2  190000
3  130000
4  120000
5  150000